InformationRegisters/НепереодическиеПараметры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>НепереодическиеПараметры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОбщегоНазначения/Ext/Module.bsl
Функция ПолучитьПодключениеБД(ПараметрыСоединения) Экспорт
	
	ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ = Неопределено;
	
	Доступно = ТипЗнч(ПараметрыСоединения) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(ПараметрыСоединения);
	
	Если Не Доступно Тогда
		Возврат ЗНАЧЕНИЕ_ПО_УМОЛЧАНИЮ
	КонецЕсли;
	
	Данные = ПараметрыСоединения;
	
	V83COMConnector= Новый COMОбъект("V83.COMConnector");
	Попытка
		Возврат V83COMConnector.Connect(ПараметрыСоединения);
	Исключение
		Комментарий = ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("ПолучитьПодключениеБД()", УровеньЖурналаРегистрации.Ошибка, , Данные, Комментарий);
	КонецПопытки;	
КонецФункции

Функция НепереодическийПараметр(Имя) Экспорт
	//Возвращает значение непереодического параметра по его имени
	//------------------------------------------------------------
	Доступно = Истина;
	Доступно = Доступно И ТипЗнч(Имя) = Тип("Строка");
	Доступно = Доступно И ЗначениеЗаполнено(Имя);
	Если Не Доступно Тогда
		Возврат "ошибка";
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Т.Значение КАК Значение ИЗ РегистрСведений.НепереодическиеПараметры КАК Т ГДЕ Т.Ид = &Ид");
	Запрос.УстановитьПараметр("Ид", Имя);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат "ошибка";
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Значение;
КонецФункции
